{"title":"How to Fly a Drone","date":"2017-07-23T07:00:00.000Z","body":"<p>For our first blog post, it makes sense to start at the beginning. How else will we get off the ground?</p>\r\n\r\n<p>Today's popular drones move like helicopters. Their stability relies on not one but four rotors, hence the term <em>quadcopter</em>. Each propeller's speed contributes to the aircraft's overall movements, and responds to your input via remote control—a radio transmitter linked to the drone's antenna, or receiver.</p>\r\n\r\n<p>To be clear, not all drones are quadcopters. Any aircraft that is piloted remotely can be considered a drone, so yes - that model airplane you played with as a child could technically meet the criteria. However, the ability for multirotor drones to hover in place while carrying various sensors has revolutionized a multitude of industries and hobbies, so let's focus on flying these aircraft.</p>\r\n\r\n<h2>The axes of movement</h2>\r\n\r\n<p>The first time you fly, you'll want to focus on using each of the following movements individually. As you push the sticks with your thumbs, focus on the association between what your thumb is doing and what the drone is doing. Later, when you need to fly instinctively and combine these movements, your success will depend on these associations becoming second nature.</p>\r\n\r\n<h2>Throttle</h2>\r\n\r\n<p>Throttle is simply the speed of the rotors, and it is controlled by forward and backward movement of the left stick on your remote control. Pushing forward increases the speed of all rotors equally, causing the aircraft to move upwards with respect to its vertical axis. This is the easiest movement to conceptualized because it is the only movement a drone can perform that is not a rotation. It is also the first maneuver you will attempt, since it's the only way to get off the ground.</p>\r\n\r\n<h2>Yaw</h2>\r\n\r\n<p>Yaw (also known as rudder) is the drone's rotation around the vertical axis, and is controlled with left-to-right movement of the left stick. You can also think of it as the “flat\" movement, since it involves no change in elevation or tilting of the aircraft. After experimenting with yaw, you will immediately notice how important it is to keep track of where the front of the drone is. If you turn 180 degrees, then suddenly left is right and right is left (from the pilot's perspective). The key is to get “in the head of the drone\" so that you are comfortably able to pilot from the drone's perspective. If you lose track of direction at any time, use the color of the lights on the drone (red for front, green for rear) to orient yourself.</p>\r\n\r\n<h2>Pitch</h2>\r\n\r\n<p>Pitch is a rotation around the horizontal axis, meaning that it will tilt the drone forwards or backwards. It is controlled by moving the right stick forward and backward, and results in forward and backward movement of the drone respectively. Pretty straightforward (pun intended).</p>\r\n\r\n<h2>Roll</h2>\r\n\r\n<p>Using roll will rotate your drone around the Z (depth) axis, which will tilt it to the left or right, causing it to drift to the side. This is accomplished by nudging the right stick sideways. As you can see, the right stick is used to control all of the movements involving tilt, and that you can combine these tilts to move in any horizontal direction no matter which way the drone is facing.</p>\r\n\r\n<h2>How to do a banked turn</h2>\r\n\r\n<p>Those of us who have no experience as pilots are used to controlling two axes of movement. When driving a car, you can accelerate forward and backward, or you can steer left to right. Because a drone's remote control gives you control in twice as many movements, it can be a bit overwhelming to consider how you might approach something like a banked turn, since it requires coordinating movements along multiple axes simultaneously. As you might expect, there are a number of ways to accomplish a banked turn, and you can experiment with each of them.</p>\r\n\r\n<h2>Look, one hand!</h2>\r\n\r\n<p>Consider the right stick on your remote control. By gradually moving the direction of tilt with just this control, you can accomplish the simplest form of a banked turn. This is a nice practice move for beginners because it doesn't change the forward direction of the drone, so your perspective remains aligned with that of the vehicle.</h2>\r\n\r\n<h2>Pitch + Yaw</h2>\r\n\r\n<p>The next step is to try moving steadily forward with the right stick, then applying a bit of yaw with the left stick. This is the primary move for getting comfortable with the drone facing in the opposite direction of you. First try a circular movement, then a figure eight. This maneuver can take up a fair amount of flying space, so make sure there are no trees, buildings, or other obstructions in the vicinity. </p>\r\n\r\n<h2>Putting it all together</h2>\r\n\r\n<p>To pull off those awesome tight turns you see in drone racing videos, you'll essentially need to combine the movements in the two previous approaches. While moving forward, roll to the left, and then yaw slightly left as well to tighten the movement. For this maneuver, physical coordination will be more helpful than reading, so get out there and try it!</p>\r\n\r\n<h2>How High Can I Fly My Drone?</h2>\r\n\r\n<p>In the United States, you're restricted to 400 feet above the surface beneath you. That means 400 feet above the roofs of any buildings or trees, not the ground beneath them.</p>\r\n\r\n<p>If you're curious about the technical limits of your drone, DJI software will lock out your altitude at 1,500 feet. With an unusual degree of technical know-how, you could get a Phantom up to 11,000 feet—and get in a heap of trouble.</p>\r\n\r\n<h2>Next Steps</h2>\r\n\r\n<p>If you've stuck with it long enough to feel comfortable with these movements, you might be considering some <a href=\"https://pilothound.com/online-drone-classes\">online drone piloting classes</a>. Aerial photography offers a wide range of both artistic and business opportunities in a <a href=\"https://pilothound.com/drone-pilot-jobs\">range of industries</a>. If you're really serious about making money with your flight skills then you'll want to start studying for your <a href=\"https://pilothound.com/part-107-training\">Part 107 Remote Pilot Certification</a>. Happy flying!</p>"}